francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
/*******************************************************************************
 * File:   main.c
 * Author:  Petrone
 * Title: V5 - 
 * 
 * Created on 27 de agosto de 2022, 06:32a.m. c0nsulf3mw1f1
 * 
 *  NOTA: 
 * 
 * 
 ******************************************************************************/
#include "p33Fxxxx.h"
#include <xc.h>
#include <stdint.h>            //Includes uint16_t definition                    
#include <stdbool.h>           //Includes true/false definition          
#include <stdio.h>
#include <string.h>
#include "configuraciones.h"   //System funct/params/osc/peripheral config 
#include "timer.h"
#include <uart.h>
#include "i2cEmem.h"           //manejo de memoria EEprom 24LC256
#include "hardware.h"          //Definicion de nombres para pines  de puertos E/S
#include "constantes.h"
#include <p33FJ256MC710.h>
/*  Configuracion Puerto serial para velocidades de 115200 - 9600 Baudios*/
#define FCY 35007500UL
#define BAUDRATE 115000 //colocar 115000 para que BGRVAL=18 o 9596 para BGRVAL=227
#define BRGVAL ((FCY/BAUDRATE)/16)-1 
#include "libpic30.h"




//unsigned char wSPI[20];

// ********** DEFINICIONES ***********

float version = 030423; //03 de Abril de 2023


/***************************************************************************
 *                 TODAS   VARIABLES  DEL PROCESO                              *
 ***************************************************************************/

// Orden alfabetico          E/S     Descripcion - NO implementado=XXX - NF=NO FISICA

unsigned int ND = 0; //EA10*=RC1   nivel de mix oil     
// Pcic=0    ;   //ED05    Pulsador de cicl-Repite a la Sk1   hard.h
// PEc=0     ;   //(RS232) peso de cansaste en carga 
unsigned int PIR = 0; //EA20*    Presion interna del reactor
// EApt=0   ;   //futura  Extractor de aire 
// Qarr=0   ;   //REL.K3  Quemador Arrancar                  hard.h
unsigned int Qgasoil = 0; //XXX     Habilitar Goil como combustible
//            Qmarch=0    ;   //ED06    Quemador en marcha                 hard.h
unsigned int Qmot = 0; //XXX     Quemador solo encender motor
//            Qok=0       ;   //ED07    Quemador OK

unsigned int RH = 0; //HAB     Relay de Habilitacion
// SEL=0    ;   //RD12    Seleccion de EAnalog Altas/Bajas   hard.h    
// SKC1=0   ;   //ED10    Softkey codificada en binario      hard.h
// SKC2=0   ;   //ED11    Softkey codificada en binario      hard.h 
// SKC3=0   ;   //ED12    Softkey codificada en binario      hard.h
unsigned int TCF = 0; //EA4 SEL=1*   Temperatura en la Camara de Fuego
unsigned int tCIC = 0; //NF           Tiempo en Pirolisis 
unsigned int TD = 0; //EA4 SEL=0*   Temperatura MixOil en Deposito
unsigned int TIB = 0; //EA3 SEL=0*   Temp Int Reac ETBasculante
unsigned int TIP = 0; //EA3 SEL=1*   Temp Int Reac ETPreCal
unsigned int TIR = 0; //EA2 SEL=1*   Temperatura Interna Reactor (MEDIDO))
unsigned int TIR1 = 0; // TIR CON SOBRETEMPERATURA A ENVIAR
unsigned int TIR2 = 0; // TIR PARA ENVIAR A SCC 
// unsigned int VGpc=0  ;   //REL.K1  Abrir EV Gas en Estac PreCal       hard.h 
unsigned int Pservos = 0; //        Pulsador de servos
// AlarS=0  ;   //SD08    Indicador Acustico de Alarma       hard.h
// AlarVR=0 ;   //SD07    Ind. Luminoso Alarma Bal Roja      hard.h 
// AlarVV=0 ;   //SD06    Ind. Luminoso Alarma Bal Verde     hard.h
unsigned int ApQ = 0; //SAnalog Pantalla Apert GAS Quemad (8bit)   
// ApSv1=0  ;   //SD01    Apertura Servo Val (palabra 4 bit) hard.h
// ApSv2=0  ;   //SD02    Apertura Servo Val (palabra 4 bit) hard.h
// ApSv4=0  ;   //SD03    Apertura Servo Val (palabra 4 bit) hard.h
// ApSv8=0  ;   //SD04    Apertura Servo Val (palabra 4 bit) hard.h
bool DOK = 0; //NF      Deposito de Mix Oil OK (Nivel OK)
//unsigned int  EAmarch ;   //futura  Motor Extractor de Aire en marcha
// HAB=0    ;   //SD05    Cadena de pulsadores de Emergencia hard.h
// Garr=0   ;   //Rel.K4  Grua Marcha: Habilita func grua    hard.h
// Gok=0    ;   //ED02    Grua Ok                            hard.h
// Larr=0   ;   //REL.k2  ARRANCAR LAVADORA                  hard.h
// Lmarch=0 ;   //ED03    Lavadora EN MARCHA                 hard.h
// Lok=0    ;   //ED04    Lavadora OK-Lav SIN ALARMAS        hard.h
// IArr=0   ;   //SD09    Forzar Alar Incendio               hard.h


/******************************************************************************    
 *                  FIN VARIABLES DEL PROCESO                                 *
 ******************************************************************************/

/***************************************************************************
 *                      VARIABLES NF                                       *
 ***************************************************************************/
// VARIABLE CARTELES DA
bool REhorno = 0; //NF  DA[0]   Reactor en el horno 
bool LlaQuemador = 0; //NF  DA[1]   LLama de quemador+Fuego Horno+ Cartel
bool AlarV = 0; //NF  DA[2]   Alarma Verde
bool REbasc = 0; //NF  DA[3]   Reactor en estacion Basc  
bool REpc = 0; //NF  DA[4]   Reactor en estacion PreC  
bool Ctl_Llama = 0; //NF  DA[5]   Cartel estacion PreC
bool Cesto_0 = 0; //NF  DA[6]   COndicion Cesto
bool Cesto_1 = 0; //NF  DA[7]   COndicion Cesto
bool Molino_march = 0; //NF  DA[8]   CARTEL MARCHA+LLUVIA PLASTICO
bool BombaM_march = 0; //NF  DA[9]   CARTEL MARCHA BOMBA               
bool EN_ESPERA = 0; //NF  DA[10]  EN ESPERA   
bool MODO_MANUAL = 0; //NF  DA[11]  MODO MANUAL  
bool EN_CICLO = 0; //NF  DA[12]  EN CICLO     
bool AlarR = 0; //NF  DA[13]  AlarVR 
unsigned int DA = 0;

bool Alarma_verde = 0;
bool Alarma_roja = 0;

bool QMAR = 0;
int unsigned Err = 0;
int TIRN = 0;

unsigned int DB = 0;
unsigned int ApSApSV = 0;
unsigned int ET = 0;
unsigned int tETAP = 0;
unsigned int FINAL = 0;
unsigned int RES1 = 0;
unsigned int RES2 = 0;
unsigned int RES3 = 0;
unsigned int SK = 0;


/******************************************************************************    
 *                  FIN VARIABLES DEL NF                                      *
 ******************************************************************************/


