francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
/******************************************************************************
 *     VARIABLES PARAMETROS ACTUALIZADA 8AGO23 ALMACENADA EN EEPROM24LC256    *
 ******************************************************************************/
//VALOR   | UNIDAD | NRO| SIGNIFICADO
unsigned int T = 0; //mS    | 0 | Tiempo de muestreo
unsigned int dR = 0; //Minuto | 1  | Duración MINIMA de Encendido 
unsigned int NDB = 0; //cm	   | 2  | Ascenso Nivel MixOil xcada batch (Depósito)
unsigned int NDMAX = 0; // cm    | 3  | Nivel Máximo MixOil (Depósito)
unsigned int NDMIN = 0; // cm	   | 4  | Nivel Mínimo MixOil (Depósito)
unsigned int NEQ = 0; // L/cm  | 5  | Convers Altura a Volumen (MixOil Deposito)
unsigned int PEMP = 0; // kgf   | 6  | Peso de la Mat.Prima para un batch
unsigned int PETARA = 0; // Kgf   | 7  | Peso del canasto vacío (en kgf) (Pesar)
unsigned int PIRMAX = 0; // mBar  | 8  | Presión Máxima Interna (Umbral ALARMA)
unsigned int PIRNOM = 0; // mBar  | 9  | Presión de trabajo Interna (Gauge)
unsigned int STALARM = 0; // C     | 10 | Umbral de Alarma (Excede la CONSIGNA)
unsigned int TCCORT = 0; // C     | 11 | Umbral de ALARMA por TC Cortada
unsigned int TCFAlar = 0; // C     | 12 | Umbral de ALARMA de la Cámara de Fuego
unsigned int TDMax = 0; // C     | 13 | Temp Max Interna Deposito MixOPil
unsigned int tESTR = 0; // Seg   | 14 | Tiempo de Estrella (P/watch Dog)
unsigned int TEXT = 0; // C     | 15 | Temp Max p/ extraer reactor Horno
unsigned int TIRBP = 0; // C     | 16 | Banda Proporcioal para la TIR
unsigned int TIRC1 = 0; // C     | 17 | Consigna en °C para TIR en ETAPA 1
unsigned int TIRC2 = 0; // C     | 18 | Consigna en °C para TIR en ETAPA 2
unsigned int TIRC3 = 0; // C     | 19 | Consigna en °C para TIR en ETAPA 3
unsigned int TIRNA = 0; // N8bits| 20 | Consigna MAX - MIN en la variable TIRN
unsigned int TPCMAX = 0; // C     | 21 | Temperatura Máxima de Pre Calentamiento
unsigned int tPIR1 = 0; // Min   | 22 | Pirólisis: Duración Etapa 1
unsigned int tPIR2 = 0; // Min   | 23 | Pirólisis: Duración Etapa 2
unsigned int tPIR3 = 0; // Min   | 24 | Pirólisis: Duración Etapa 3
unsigned int TMAN = 0; // C     | 25 | Temp a alcanzar en MODO MANUAL 
unsigned int TPIRO1 = 0; // C     | 26 | Temperatura de Pirólisis Etapa 1
unsigned int TPIRO2 = 0; // C     | 27 | Temperatura de Pirólisis Etapa 2
unsigned int TPIRO3 = 0; // C     | 28 | Temperatura de Pirólisis Etapa 3
unsigned int TVUELC = 0; // C     | 30 | Temp Max p/ volcar la carbonilla
unsigned int Esc500 = 0; // Adim  | 31 | 1000XFactor Mult Escala de T Int Reactor (0,500)  
unsigned int Esc800 = 0; // Adim  | 32 | 1000XFactor Mult Escala de T Cam Fuego (0,800)
unsigned int Esc060 = 0; // Adim  | 33 | 1000XFactor Mult Escala de Temp MixOil (0,059)
unsigned int EscMPX = 0; // Adim  | 34 | 1000XFactor Mult Escala Pres Int Reactor (0,050)
unsigned int EscNIV = 0; // Adim  | 35 | 10XFactor Mult Escala Vol Int Deposito (12,10)
unsigned int dPIR = 0;
unsigned int ALARLAV = 0;
unsigned int ALARINM = 0;


/******************************************************************************
 *                            FIN PARAMETROS                                  * 
 ******************************************************************************/


/******************************************************************************
 *                        PARAMETROS DERIVADOS                                *                                    *
 ******************************************************************************/
unsigned int TCCORT_MUL2 = 0;



float TIRA = 0;
unsigned int TIRIBP = 0;
float ReLCC = 0;
float NCB = 0;
float NCMAX = 0;
float NCMIN = 0;


/*****************************************************************************
 *                       FIN DE PARAMETROS DERIVADOS                         *
 *****************************************************************************/


/******************************************************************************
 *         VARIBLES DE COMUNICACION DMA,UART 1,EEPROM                         *
 ******************************************************************************/

// ----------CONTROL DE ERRORES EN COMUNICACION CHEKSUM 1 BYTE 0X00FF-----------

int CHEK_A = 0; // VARIABLE DE CHEK A=
unsigned int CHEK_P = 0; // VARIABLE DE CHEK PARAMETROS P=
unsigned int CHEK_C = 0; // VARIABLE DE CHEK COMANDO C=
unsigned int CHEK_PAR = 0; // CHEKSUM DE PARAMETROS
//------------------------------------------------------------------------------

//-----------------------  BUFFER UART  1 -------------------------------- 
char dato_Rx[TAM_Rx] = {0};


//char *Receiveddata=dato_Rx; 
unsigned int RX_CHEKP = 0; // CONTROL DEL CHEK RECIBIDO UART 1
int RX_CHEKA = 0;
unsigned int RX_CHEKC = 0;
// unsigned int RX_CHEKS=0; // SOFTKEY
//------------------------------------------------------------------------

//---------- BUFFER AUXILIAR PARA LA  DMA -------------------------------- 

unsigned int BufferA[TAM_DMA] __attribute__((space(dma))); // DE DECLARA TAMAÑO DMA
char aux_dma_tx[TAM_DMA] = {0}; // VARIABLE AUXILIAR PARA CARGAR EN DMA

// *OBSERVACION: VERIFICAR EL TAMAÑO MAXIMO DE ENVIO Y RECEPCION CONTANDO CON 
// EL CARACTER NULL '\0' AL FINALIZAR 

//-----------------------VARIABLE DE PARAMETROS EEPROM--------------------
unsigned int Eparam[30]; //OJO TAMAÑO MAXIMO (32 INT) EQUIVALE A 64 BYTES POR PAGINA
unsigned int E1param[30];
//UTILIZADA PARA GRABAR LA MEMORIA EEPROM
//1 2  3   4  5  6   7   8   9  10  11  12 13 14 15  16  17  18  19  20 21  22 23 24  25  26  27  28 29
//unsigned int cons_param[30]={1,6,250,30,49,400,100,500,200,25,510,700,40,45,300,50,430,430,430,200,120,60,90,60,200,420,420,420,120};
unsigned int cons_param[30] = {0};
unsigned int cons_param1[30] = {0};
/*****************************************************************************
 *                          FIN VARIABLES COMUNICACION                       *
 *****************************************************************************/



