francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
/******************************************************************************
 *                   VARIABLE PARA LAS SEÑALES ANALOGICAS                     *
 ******************************************************************************/

unsigned int V[CAN_ANALOG] = {0}; // CONVERSIONES ANALOGAS DIGITALES

/******************************************************************************
 *                       FIN VARIABLES ANALOGICAS                             *  
 ******************************************************************************/

/*******************************************************************************
 *                    VARIABLES DE CONTROL                                     *
 *******************************************************************************/
volatile double VF_actual = 0;
volatile double VF_anterior = 0;
double operando_a;
double operando_b;
/******************************************************************************
 *                           FIN VARIABLES DE CONTROL                         *
 ******************************************************************************/



/******************************************************************************
 *              VARIABLE DE TIEMPO TIMER 2 TICKS DE 1 SEG 1 MIN               *            
 * ****************************************************************************/
unsigned long int tareas = 0; // contador de tareas periodicas ticks t=20ms
unsigned char TIME_SEL = 0;

#define TIC 10 // Tiempo de interrupcion en milisegundos
unsigned int NP1K = (1000 / TIC); // Variable de referencia de tiempo para TP1S
unsigned int NP2S = (8000 / TIC); // Contador para actualizar comunicacion
unsigned int NP4K = (4000 / TIC); // Contador para actualizar estado de alarmas
unsigned int NP5K = (5000 / TIC); // Contador para actualizar seniales analogicas
unsigned int NP10K = (10000 / TIC); // Variable de referencia de tiempo para TP10S
unsigned int TP1S = 0; // Contador para tareas cada 1 segundo
unsigned int TP10S = 0; // Contador para tareas cada 10 segundos


unsigned int ticks = 0;
unsigned int seg = 1;
unsigned int seg_acum = 0;
unsigned int min = 0;


/*******************************************************************************
 *                FIN VARIBLES TIEMPOS                                         *
 * *****************************************************************************/


/*******************************************************************************
 *  VARIABLES PARA EL  MANEJO DE LAS SOFTKEY FISICAS (BOTONES) ANTI REBOTE     * 
 *******************************************************************************/

unsigned int SOFTK_A = 0, SOFTK_N = 0, SOFTK_N1 = 0;

/*******************************************************************************
 *                      FIN VARIABLES SOFTKEY                                  *
 *******************************************************************************/


/*******************************************************************************
 *           VARIABLE PARA EL REDIRECCIONAMIENTO DEL CICLO ARRANQUE            *
 *******************************************************************************/
unsigned int Punto = 0; //COMIENZO P=0; PUNTO CERO DIAGRAMA FLUJO  P=1  PUNTO UNO DIAGRAMA FLUJO
unsigned int SK_C = 0; // CARTEL DE LAS SOFTKEY
bool SALIR_MANUAL = 0; //BANDERA DE SALIDA CICLO MANUAL
unsigned int MODO = 0; // SELECCION MODO 0 NADA 1 AUTOMATICO 2 MANUAL.. etc

unsigned int num = 0; // BANDERA seleccion QUEMADOR =1 MOLINO =2 PRECALENTADOR =3

bool BANDERA_HELPQTCF = 0; // HELP TEMPERATURA CAMARA DE FUEGO
bool BANDERA_HELPQNDmax = 0; // HELP NIVEL DEPOSITO ALTO
bool BANDERA_HELPQNDmin = 0; // HELP NIVEL DEPOSITO BAJO
bool BANDERA_HELPQ = 0; // HABILITAR HELP

bool BANDERA_ALARMAQENC = 0; // BANDERA DE ALARMA QUEMADOR ESTANDO ENCENDIDO
bool BANDERA_ALARQUEM = 0; // BANDERA DE ALARMA QUEMADOR NO ENCIENDE
bool BANDERA_noquema = 0; // BANDERA DE IMPRESION NO HAY REACTOR
bool BANDERA_quemador = 0; //PRIMER PULSO MODO MANUAL SK1 IMPRESION
bool aviso_Qarr = 0; // AVISA CARTEL ENCENDIENDO QUEMADOR
unsigned int SK_Q = 0; // CARTEL DE LAS SOFTKEY QUEMADOR
bool APQ = 0; // HABILITA TAREA DEL HORNO 
bool apagar_Q = 0; // BANDERA APAGAR QUEMADOR
bool BANDERA_ACTUALIZAQ = 0; // BANDERA ACTUALIZAR DENTRO DE QUEMADOR
bool BANDERA_RETROCERQ = 0; // BANDERA PARA SALIR DEL QUEMADOR
unsigned int tiempo_ENCQUEMA = 0;
unsigned int ticks_Q = 1;
unsigned int tiempo_segQ = 0;




bool BANDERA_HELPM = 0;
bool BANDERA_ALARMOL = 0;
bool BANDERA_nomolino = 0;
bool BANDERA_molino = 0; // RETIENE PRIMER PULSO MODO MANUAL SK2
bool aviso_Larr = 0; // AVISA A LA SK2 CARTEL  ENCENDER/APAGAR MOLINO
unsigned int SK_M = 0; // CARTEL DE LAS SOFTKEY MOLINO
bool APM = 0; // HABILITA TAREA DEL MOLINO
bool apagar_M = 0; // BANDERA APAGAR MOLINO
bool BANDERA_ACTUALIZAM = 0; // BANDERA ACTUALIZAR DENTRO DEL MOLINO
bool BANDERA_RETROCERM = 0; // BANDERA PARA SALIR DEL MOLINO
bool BANDERA_lluviamarch = 0;




bool BANDERA_HELPP = 0;
bool BANDERA_ALARPRE = 0;
bool BANDERA_nopre = 0;
bool BANDERA_precalentador = 0; // AVISA A LA SK3 APAGAR PRE CALENTADOR
bool aviso_Parr = 0; // AVISA A LA SK2 CARTEL  ENCENDER/APAGAR PRE CALENATADOR
unsigned int SK_PRE = 0; // CARTEL DE LAS SOFTKEY PRECALENTADOR
bool APP = 0;
bool apagar_P = 0; // BANDERA APAGAR PRECALENTADOR
bool BANDERA_ACTUALIZAP = 0;
bool BANDERA_RETROCERP = 0;


unsigned int ESTADO_0 = 0;
unsigned int ESTADO_1 = 1;
bool RETORNAR = 0; //BANDERA INDICADOR DE RETORNO


bool tabla_sk = 0; //BANDERA IMPRESION TABLA

/*******************************************************************************
 *             VARIABLES BANDERAS DE PUESTA EN MARCHA                                   *
 *******************************************************************************/
bool EnCICLO = 0;
unsigned int Ppal = 0;

/*******************************************************************************
 *             VARIABLES BANDERAS DE EMERGENCIA
 *******************************************************************************/
bool signal_emergencia = 0;

int main(void) {

    int i = 0; //VARIABLE DE REPETICION EN CICLOS CONTROLADOS  

    //----------------------------------------------------------------------------//
    //        INICIO DE EJECUCION DEL PROMAGRAMA LUEGO DEL ENCENDIDO
    //----------------------------------------------------------------------------//    

