francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
    configurarSistema(); //Deshabilita WDT,configura PLL y Entradas/Salidas
    inicializaUART(BRGVAL); //Inicializa UART     
    inicializaADC(); //Inicializacion ADC 10 bit
    inicializaDMA(); //Inicializa DMA 
    inicializaTimer2(); //iniciliza timer2 (NO INICIA) 



    //INDICADOR OK EN PLACA LED VERDE 
    SEL = 1;

    for (i = 0; i <= 3; i++) {
        __delay_ms(200);
        printf("%d\n", i);
    }

    /*PRUEBA DE RELEES*/

    PCarr = 1; //ACTIVAS EN CERO K4 BORNERA RELE ARDUINO SON SALIDAS 
    Larr = 1; //ACTIVAS EN CERO K3 BORNERA RELE ARDUINO	
    Qarr = 1; //ACTIVAS EN CERO K2 BORNERA RELE ARDUINO
    Garr = 1;

    AlarVV = 1;

    //   escribir_Eeprom(cons_param,30,0);

    //LECTURA DE PARAMETROS DESDE LA EEPROM CON TIEMPO DE ESPERA     
    __delay_us(2);
    leer_Eeprom(Eparam, 30, 0); // Carga parametros pag 0 desde Eeprom24CL256
    __delay_us(2);
    leer_Eeprom(E1param, 30, 1); // Carga parametros pag 1 desde Eeprom24CL256

    control_param();

    __delay_ms(4000);


    /*PARAMETROS DERIVADO CALCULOS*/

    /*QUEMADOR*/
    if (TIRBP != 0)
        TIRA = (float) 255 / TIRBP;
    /*DEPOSITO */
    if (NDMAX != 0)
        ReLCC = CMAX / NDMAX;

    NCB = ReLCC*NDB;
    NCMAX = CMAX - NCB;
    NCMIN = ReLCC*NDMIN;

    TCCORT_MUL2 = TCCORT << 1; // PARAMETRO X 2

    //----FIN PARAMETROS DERIVADOS      

    //------------------- LOOP TAREA NO PERIODICA (PSEUDO PERIODICA) --------------------


    while (1) {

        Punto = 0; //POSICIONA  TAREA PERIODICA EN PUNTO 0


        //-------- COMIENZO DEL PUNTO A : EMPIEZA TAREA PERIODICA 10ms ---------                        

        do { // PARA VOLVER DE PANTALLA
            //LEE ENTRADA DE WATCH DOG RELE NO HABLITADO SEGURIDAD DEPEGADO


            HAB = 0; // HABILITACION = 0 CADA VEZ QUE INGRESE
            WDD = 0;


            while (WDOK == 0) {
                __delay_ms(1000);
            }


            STATUS_LED = 1;
            PCarr = 1; //ACTIVAS EN CERO K4 BORNERA RELE ARDUINO SON SALIDAS 
            Larr = 1; //ACTIVAS EN CERO K3 BORNERA RELE ARDUINO	
            Qarr = 1; //ACTIVAS EN CERO K2 BORNERA RELE ARDUINO
            Garr = 1; //ACTIVAS EN CERO K1 BORNERA RELE ARDUINO
            apagar_Q = 0; // BANDERAS
            apagar_M = 0; // BANDERAS 
            apagar_P = 0; // BANDERAS
            RUN_Timer2();
            RX_CHEKC = 0;

            if (Punto == 0) {

                do {
                    /* CHEK DE PUERTO Y TABLA DE PARAMETROS */
                    if (strncmp(dato_Rx, "H=", 2) == 0)
                        sscanf(dato_Rx, "H=%2x", &RX_CHEKC);

                } while (RX_CHEKC != CHEK_C);

            }
            //------ HASTA AQUI SE VERIFICA EL CHEKSUM DE TABLA DE PARAMETROS VARIABLE CSUM Y PUSO PANTALLA 2  ------------------                        
            HAB = 1;
            Punto = 1; //POSICIONA  TAREA PERIODICA EN PUNTO 1

            do {
                if (Punto == 1) {
                    switch (SOFTK_A + (Ppal = (!(NO_EMER)&!(SON)) << 4)) {
                        case 2:
                            if (SOFTK_N == 0) {
                                Punto = 2;
                                SK_C = 0;
                            }
                            break;

                        case 16: Punto = 3; //SE PRESIONA PULSADOR  SERVOS CASE 16
                            SK_C = 0;
                            break;

                        default: break;
                    }


                }
                if (strncmp(dato_Rx, "H=", 2) == 0)
                    sscanf(dato_Rx, "H=%2x", &RX_CHEKA); // verificacion de CRC enviado A= 


            } while (Punto != 2 && RX_CHEKA != CHEK_A);

            /*    HASTA AQUI SE ESPERA EL COMANDO SERVOS PPAL O PARAMETROS  */

            /*************************************************************************************************** 
             *    PUNTO 4 COMIENZA CON LA VERIFICACION O PRODDUCCION CON POSIBILIDAD DE ACCEDER A  PARAMETROS  *
             *    EN ESTE PUNTO YA ESTAMOS EN LA PANTALLA PRINCIPAL SE DEBEN VISUALIZAR VARIABLES FISICAS      *                          *
             ***************************************************************************************************/

            if (!(Punto == 2)) {
                do {
                    //(SOFTK_ACTUAL+PPP)) SERAN DOS VARIABLES A CONSIDERAR DE ACUERDO A ESTO SERAN 2 OPCIONES
                    switch (SOFTK_A + (Ppal = (!(NO_EMER)&!(SON)) << 4)) {

                        case 18:
                            if (Punto == 4 && SOFTK_N == 0) {
                                Punto = 2;
                            }
                            break;

                        case 0:
                            Punto = 0;
                            signal_emergencia = 1;
                            __delay_ms(10000);

                            break; // SE ACTIVA EMERGENCIA PPAL          


                        case 22:
                            if (Punto == 4 && SOFTK_A == 6 && SOFTK_N == 0) {
                                SOFTK_N = 0;
                                Punto = 0;
                                HAB = 0;
                                __delay_ms(10000);
                            }
                            // VOLVER AL PUNTO 0 PANTALLA ARRANQUE  TECLA 3  
                            break;

                        default:break;

                    }

                    //REVISAR BORRADO DE SK 
                    if (strncmp(dato_Rx, "H=", 2) == 0)
                        sscanf(dato_Rx, "H=%2x", &RX_CHEKA); // verificacion de CRC enviado A= 


                    /* EN ESTE PUNTO SE REALIZA EL CHEKEO DEL PUNTO 4 ANTES DE PASAR A PRODUCCION */

                    //PRUEBA MODO DE SELECCION        
                    switch (MODO) {
                        case 1:
                            Automatico();
                            break;


                        case 2:
                            Manual();
                            break;


