francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
                        default: break;

                    }






                } while (Punto != 2 && Punto != 0); //salida de ciclo [<---(NO)---->]

            }



        } while (Punto == 0); // TECLA VOLVER

        //--------------------------COMIENZO DEL PUNTO B (PARAMETRIZACION)-------------------------------

        /*    EN ESTE PUNTO SE DECIDE PARAMETRIZAR   */
        /*  COMIENZO DEL PUNTO B
         *  STOP_Timer2() ;//DETIENE TIMER 2 OK
         *  se envia cambio de pantalla (edicion parametros)   OK
         *  variable = variable obtenida en el ciclo anterior    OK    
         *  envio de tabla actual                                OK
         *  empieza ciclo con condicion de salida check tabla  
         *  escuchar utilizar ssprintf() en interrupcion serie para salir ciclo
         *  se procede a escribir Eeprom   
          Eeprom escribir_Eeprom(constantes_Parametro,30,0); //maximo de datos a cargar 64 para 32 variables int  
         *  produce reset absoluto  -> __asm__volatile("reset");
      
      }
         */

        //---------------- PUNTO = 2 ( PARAMETROS ) ----------------------     

        /*
             CASOS 2 : 
         * FALLA DE CHEK_P  :  NO SE ENVIA "COMANDO" A MMI 
         * PASA POR SOFTKEY :  SE ENVIA "COMANDO" Y SE VALIDA CHEK_C ANTES DE LLEGAR
         */

        if (Punto == 2) {

            STOP_Timer2(); //DETIENE TIMER 2 (TAREA PERIODICA DE 10MS )
            HAB = 0; // SE HACE HABILITACION = 0
            WDD = 0;


            STATUS_LED = 1;
            __delay_us(50);

            parametros();
            do {

                printf("A=00000000000000000000000000000000000000002000000000000000000202\n");
                __delay_ms(15);
                if (strncmp(dato_Rx, "H=", 2) == 0) {
                    sscanf(dato_Rx, "H=%2x", &RX_CHEKA);
                } // verificacion de CRC enviado A= 

            } while (RX_CHEKA != 2);


            __asm__ volatile ( "reset "); //Instruccion de reinicio A LA SALIDA DE PARAMETROS    
        }

        /* FIN DE PARAMATROS */

        //-------------------COMIENZO DEL PUNTO C-----------------------------------    
        /*
         * colocar MMI en pantalla principal ok
         * Comienza envio rutinario de msj 10seg   0k
         * salidas HAB=Garr=1; (energia electrica) 0k
         * verificar las condiciones de ciclo:
                -Reactor en el horno
                -NO EMERGENCIA ED9=1
                -ND<250-NDB
     
         GENERAR ADVERTENCIA EN CASO DE INCUMPLIMIENTO
             -PEc>=Ptara   Cesto en la balanza
             -Larr=1       Molino lavador en marcha
     
         */
        //----------------- FIN DEL SISTEMA DE ARRANQUE---------------------------------

    }// FINAL DE LA TAREA NO PERIODICA





    return 0;
}

/*INTERRUPCION TIMER2 10ms TAREA PERIODICA */

void __attribute__((__interrupt__, no_auto_psv)) _T2Interrupt(void) {
    /* Interrupt Service Routine code goes here */

    Garr = SON;


    int i; //for del conversor prueba carteles
    tareas++;
    TIME_SEL++;
    /*TIEMPO DE CONMUTACION LLAVE ANALOGICA*/
    if (TIME_SEL == 200) {

        SEL ^= 1;

        TIME_SEL = 0;
    }
    //-------------------------------------

    if ((signal_emergencia == 1)) { // PULSADOR DE EMERGENCIA BORRAR TODAS LAS BANDERAS Y APAGAR MAQUINAS

        __asm__ volatile ( "reset "); //Instruccion de reinicio A LA SALIDA DE PARAMETROS    

    }


    if (tareas == 0xffffff) {
        tareas = 1;
    }



    if (HAB == 1) {
        pulso_watchdog();
    }

    // EJECUTA SIEMPRE   
    SOFTK_N1 = (!SKC3) << 2 | (!SKC2) << 1 | (!SKC1);

    if (SOFTK_A != SOFTK_N1) {
        SOFTK_A = SOFTK_N;
        SOFTK_N = SOFTK_N1;
    }


    if (Punto >= 3 && !(tareas % 5)) {

        LlaQuemador = apagar_Q == 1 ? 1 : 0; //NF  DA[1]   LLama de quemador+Fuego Horno+ Cartel
        REhorno = (TIR <= TCCORT_MUL2) ? 1 : 0; //NF  DA[0]   Reactor en el horno 
        AlarV = Alarma_verde == 1 ? 1 : 0; //NF  DA[2]   Alarma Verde
        AlarR = Alarma_roja == 1 ? 1 : 0;
        REbasc = (TIB <= TCCORT_MUL2) ? 1 : 0; //NF  DA[3]   Reactor en estacion Basc  
        Ctl_Llama = apagar_P == 1 ? 1 : 0; //NF  DA[5]   Cartel estacion PreC
        REpc = (TIP <= TCCORT_MUL2) ? 1 : 0;
        ; //NF  DA[4]   Reactor en estacion PreC  


        Cesto_0 = (!PE1) && (PE2); //NF  DA[6]   COndicion Cesto
        Cesto_1 = (!PE2) && (!PE1); //NF  DA[7]   COndicion Cesto

        Molino_march = BANDERA_lluviamarch == 1 ? 1 : 0; //NF  DA[8]   
        BombaM_march = !LBA; //NF  DA[9]   COndicion Cesto  

        ND = ND & 0x0fff;
        TIR = TIR & 0x0fff;
        TIP = TIP & 0x0fff;
        TCF = TCF & 0x0fff;
        PIR = PIR & 0x0fff;
        TIB = TIB & 0x0fff;
        TD = TD & 0x0fff;

        if (TIME_SEL >= 100) {

            if (SEL == 0) {
                for (i = 0; i <= TAM_CONVERSOR - 1; i++)
                    V[i] = convierteAD(i);
                ND = (ND * NDa + V[0] * NDb);
                TIR = TIR * TIRa + V[1] * TIRb;
                TIP = TIP * a + V[2] * b;
                TCF = (TCF * a + V[3] * b);


            } else {

                for (i = 0; i <= TAM_CONVERSOR - 1; i++)
                    V[i + 4] = convierteAD(i);
                ND = ND * a + V[4] * b;
                PIR = PIR * a + V[5] * b;
                TIB = TIB * a + V[6] * b;
                TD = TD * a + V[7] * b;

            }
        }


        BANDERA_HELPQNDmax = ((float) ND >= NCMAX) ? 1 : 0; //no se puede realizar mas ciclos deposito lleno
        BANDERA_HELPQNDmin = ((float) ND < NCMIN) ? 1 : 0; // falta nivel para realizar pirolisis
        BANDERA_HELPQTCF = !QOK;


    }


    //-------------- FIN TABLA ACTUALIZACION VARIABLES ANALOG/DIGITAL  ------------------- 


    switch (Punto) {
            /* ENVIO EL CHSUM DE LA TABLA DE PARAMETROS CAMBIO A PANTALLA 2  */
            /* INICIO DE PUNTO 0 */
        case 0:

            if (Punto == 0 && !(tareas % 25)) {

                if (RX_CHEKC != CHEK_C && DMA0REQbits.FORCE == 0) {
                    sprintf(aux_dma_tx, "C=%.2x%.2x%.2x\n", 1, CHEK_P, CHEK_C); // ME DEVUELVE LO QUE YO LE ENVIO COMO CHEK_P
                    cargar_DMA_C(aux_dma_tx);
                    enviar_DMA();
                }

