francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
                if (RX_CHEKC == CHEK_C) {
                    RX_CHEKC = 0;
                    CHEK_A = -1; // si se corta elmensaje manda H=0 OJO
                    SK_C = 0;
                    tareas = 1;
                }


            }//CIERRE DE PUNTO 0
            break;
            /* FIN DE PUNTO 0 */


            /* INICIO DEL PUNTO 1 PANTALLA ARRANQUE 1 LETREROS ESTADOS */
        case 1:

            if (Punto == 1 && !(tareas % 25)) {
                switch (SK_C) {
                    case 0:
                        if (RX_CHEKA != 49) { //CONTROL DE LOS CHEK ENVIADO
                            cargar_DMA_A("A=00000000000000000000000000000000000000001110000000000000200031\n");
                            enviar_DMA();

                        }
                        if (RX_CHEKA == 49) {
                            SK_C = 1;
                            CHEK_A = -1;
                            tareas = 1;
                        }

                        break;

                    default: break;
                }
            }/* FIN DE PUNTO 1*/
            break;

        case 2:

            if (RX_CHEKA != CHEK_A) {//sk eo
                generar_A(0x650edc, 0x0000, 0, 0);
            }
            /*
            if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO BORRAR TODAS LAS SK
                SK_C = 1;
                tabla_sk = 1;
            }
             */

            /* SE ACCIONO SERVOS (PUNTO = 3 ) PASA A PANTALLA PPAL*/
        case 3:

            // FRANCO: AGREGAR CARTEK DE GRUA FUERA DE SERVICIO, HABLAR CON JAVIER

            if (Punto == 3) { //IMPRESION LETREROS SELECCION AUTOMATICO-MANUAL-PARAMETROS-ACTUALIZAR-RETROCEDER
                Alarma_verde = 1;
                EN_ESPERA = 1;
                MODO_MANUAL = 0;
                EN_CICLO = 0;
                DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;


                // IMPRESION DE  LETREROS DE LAS SOFTKEY
                switch (SK_C) {

                        /* SE PASA A PANTALLA PRINCIPAL Y SE IMPRIMEN SOFTKEY */
                    case 0:

                        if (RX_CHEKA != CHEK_A && !(tareas % 25)) {
                            generar_A(0x650321, 0x0100, 1, 0);

                        }

                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO CAMBIO DE PANTALLA
                            CHEK_A = -1;
                            tareas = 1;
                            SK_C = 1;
                            Punto = 4;

                        }
                        break;

                    default:
                        Garr = 0;
                        break;

                }




            } // FIN DEL PUNTO 3 


            break;

            /*************************************************************************************************** 
             * PUNTO = 4  SE REALIZA CHEKEO YA SE HAN ACTIVADO LOS SERVOS TIENE OPCIONES PARA IR A PARAMETROS  *
             *   TIEMPO LARGOS DE ENVIO DE DATOS 10S CON POSIBILIDAD INMEDIATA                                 *
             ***************************************************************************************************/
        case 4:
            //ESPERANDO COMANDO - MANUAL- AUTOMATICO- ACTUALIZAR
            if (Punto == 4) {

                // TECLA RETROCEDER SK 6
                if (SOFTK_A == 6 && SOFTK_N == 0) {
                    SOFTK_A = 0;
                    SK_C = 0;
                    Punto = 0;
                }

                // ENVIO DE MSJ ACTUALIZACION DE PANTALLA CADA 10 SEGUNDOS
                if (!(tareas % 250)) {
                    DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;
                    generar_A(0x650321, 0x0100, 1, 0);

                }

                // TECLA ACTUALIZAR SK 5    
                if (SOFTK_A == 5 && SOFTK_N == 0) {
                    SOFTK_A = 0;
                    generar_A(0x650321, 0x0100, 1, 0);
                }

                //TECLA SK 3 MODO MANUAL
                if (SOFTK_A == 3 && SOFTK_N == 0) { // PRESIONO SK 3- ELIJO MODO MANUAL
                    SOFTK_A = 0;
                    SOFTK_N = 0;
                    Punto = 5; //MODO MANUAL
                    MODO = 2; // TAREA NO PERIODICA ENTRA EN MANUAL
                    tareas = 1;
                    SK_C = 0;
                    ESTADO_0 = 0;
                    tabla_sk = 0;

                }

            }
            //FIN PUNTO 4    
            break;


        case 5:
            /* FUNCIONAMIENTO DEL MODO MANUAL */
            if (Punto == 5) {
                //DENTRO DE MODO MANUAL TECLA RETROCEDER - ACTUALIZAR

                if (ESTADO_0 == 0 || ESTADO_0 == 1 || ESTADO_0 == 2 || ESTADO_0 == 3) {
                    EN_ESPERA = 0;
                    MODO_MANUAL = 1;
                    EN_CICLO = 0;
                }

                DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;


                //-----------------------------------------------------------------------------
                if (SALIR_MANUAL == 1) {
                    switch (SK_C) {
                        case 1:
                            if (RX_CHEKA != CHEK_A && !(tareas % 20)) { //CARTEL PULSAR RETROCEDER PARA SALIR
                                generar_A(0x650edc, 0x0322, 0, 0);

                            }
                            if (RX_CHEKA == CHEK_A) { //
                                CHEK_A = -1;
                                tareas = 0;
                                SK_C = 2;
                            }
                            break;
                        default: break;
                    }
                }


