francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
                if (SALIR_MANUAL == 1) { //SE PRESIONO RETORNAR POR SEGUNDA VEZ 
                    if (SOFTK_A == 6 && SOFTK_N == 0) {
                        SOFTK_N = 0;
                        SOFTK_A = 0;
                        SALIR_MANUAL = 0;
                        MODO = 0;
                        Punto = 3;
                        tareas = 0;
                        SK_C = 0;
                        tabla_sk = 0;
                        ESTADO_0 = 0;
                        CHEK_A = -1;
                        num = 0;

                        /*BORRAR TODAS LAS BANDERAS*/
                        /*QUEMADOR*/
                        APQ = 0;
                        reset_tiempoQ();
                        apagar_Q = 0;
                        aviso_Qarr = 0;
                        BANDERA_quemador = 0;
                        Qarr = 1;

                        /*PRECALENTADOR*/
                        APQ = 0;
                        apagar_P = 0;
                        aviso_Parr = 0;
                        BANDERA_precalentador = 0;
                        PCarr = 1;


                        /*MOLINO*/
                        APM = 0;
                        apagar_M = 0;
                        aviso_Larr = 0;
                        BANDERA_lluviamarch = 0;
                        BANDERA_molino = 0;
                        Larr = 1;

                        break;
                    }
                }

                // PRIMER PULSO RETROCEDE  FLANCO DE BAJADA SOFT 6
                if (SOFTK_A == 6 && SOFTK_N == 0 && SALIR_MANUAL == 0 && num == 0 && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                    //  if(ESTADO_0==0  ){ // SI ESTADO == 0 VUELVE A MANUAL
                    SOFTK_N = 0;
                    SALIR_MANUAL = 1; //BANDERA DE SALIDA   
                    tabla_sk = 0; // tabla no habilitada
                    // }
                }


                // RETROCEDER DENTRO DE QUEMADOR
                if (SOFTK_A == 6 && SOFTK_N == 0 && SALIR_MANUAL == 0 && num == 1) {
                    BANDERA_RETROCERQ = 1;
                }

                // RETROCEDER DENTRO DE PRECALENTADOR
                if (SOFTK_A == 6 && SOFTK_N == 0 && SALIR_MANUAL == 0 && num == 3) {
                    BANDERA_RETROCERP = 1;
                }

                // RETROCEDER DENTRO DE MOLINO
                if (SOFTK_A == 6 && SOFTK_N == 0 && SALIR_MANUAL == 0 && num == 2) {
                    BANDERA_RETROCERM = 1;
                }




                // BORRADO DE SK Y  LETREROS DE ZONA
                if (SALIR_MANUAL == 0) {
                    switch (SK_C) {
                        case 0:
                            if (RX_CHEKA != CHEK_A && !(tareas % 20)) {//sk eo
                                generar_A(0x650edc, 0x0300, 0, 0);
                            }
                            if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO BORRAR TODAS LAS SK
                                CHEK_A = -1;
                                ESTADO_0 = 0;
                                ESTADO_1 = 1;
                                SK_C = 1;
                                tabla_sk = 1;
                            }
                            break;
                        default: break;
                    }
                }

                //--------------------------------------------------------------------------------------------------                         
                ESTADO_0 = apagar_Q << 2 | apagar_M << 1 | apagar_P;

                if (tabla_sk == 1 && !(tareas % 50)) {
                    //  ESTADO 0=000
                    if (ESTADO_0 != ESTADO_1 && ESTADO_0 == 0 && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {

                        AlarR = 0;
                        AlarV = 0;
                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x650edc, 0x0333, 0, 0);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }

                    } // FIN ESTADO 0=000

                    //  ESTADO 1=001             
                    if (ESTADO_0 != ESTADO_1 && ESTADO_0 == 1 && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 0;
                        AlarV = 1;
                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x650bdc, 0x0300, 0, 0);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;
                        }
                    } // FIN ESTADO 1=001


                    //  ESTADO 2=010             
                    if (ESTADO_0 != ESTADO_1 && ESTADO_0 == 2 && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 0;
                        AlarV = 1;
                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x650eac, 0x0300, 0, 0);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK2 APAGAR MOLINO
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }

                    } // FIN ESTADO 2=010


                    //  ESTADO 3=011             
                    if (ESTADO_0 != ESTADO_1 && ESTADO_0 == 3 && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 0;
                        AlarV = 1;
                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x650bac, 0x0300, 0, 0);
                        }

                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

