francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
                        }

                    } // FIN ESTADO 3=011


                    // ESTADO 4=100    
                    if (ESTADO_0 != ESTADO_1 && ESTADO_0 == 4 && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 0;
                        AlarV = 1;
                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x650ed9, 0x0355, 0, 0);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }

                    } // ESTADO 4=100                                  


                    //  ESTADO 5=101             
                    if (ESTADO_0 != ESTADO_1 && ESTADO_0 == 5 && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 0;
                        AlarV = 1;
                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x650bd9, 0x0300, 0, 0);
                        }

                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }

                    } // FIN ESTADO 5=101


                    //  ESTADO 6=110
                    if (ESTADO_0 != ESTADO_1 && ESTADO_0 == 6 && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 0;
                        AlarV = 1;
                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x650ea9, 0x0300, 0, 0);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }

                    } // FIN ESTADO 6=110


                    //  ESTADO 7=111
                    if (ESTADO_0 != ESTADO_1 && ESTADO_0 == 7 && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 0;
                        AlarV = 1;
                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x650ba9, 0x0300, 0, 0);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }
                    } //FIN ESTADO 7


                    //-----------ESTADOS CON ERRORES-------------------------------------
                    /*QUEMADOR*/

                    // ESTADOS CON ALERTAS QUEMADOR CON AYUDA            
                    if ((ESTADO_0 == 0 || ESTADO_0 == 1 || ESTADO_0 == 2 || ESTADO_0 == 3) && BANDERA_HELPQ == 0 && BANDERA_ALARQUEM == 1 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 1;
                        AlarV = 0;
                        DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;

                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x60f000, 0x0367, 0, 0);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }

                    }

                    //ESTADOS CON ALERTAS QUEMADOR SIN AYUDA 
                    if ((ESTADO_0 == 0 || ESTADO_0 == 1 || ESTADO_0 == 2 || ESTADO_0 == 3) && BANDERA_ALARMAQENC == 0 && BANDERA_ALARQUEM == 1 && BANDERA_HELPQ == 1 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 1;
                        AlarV = 0;
                        DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;

                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x600000, 0x0367, 0, RES1);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }
                    }

                    // ERROR EN EL QUEMADOR ENCENDIDO                       
                    if ((ESTADO_0 == 0 || ESTADO_0 == 1 || ESTADO_0 == 2 || ESTADO_0 == 3) && BANDERA_ALARMAQENC == 1 && BANDERA_HELPQ == 0 && BANDERA_ALARQUEM == 1 && BANDERA_ALARPRE == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 1;
                        AlarV = 0;
                        DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;

                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x600000, 0x0367, 0, RES1);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }

                    }
                    //---------------------FIN ERRORES QUEMADOR--------------------------------------------------------------------------------------------------                     


                    // ESTADOS CON ALERTAS PRECALENTADOR                       
                    if ((ESTADO_0 == 0 || ESTADO_0 == 2 || ESTADO_0 == 4 || ESTADO_0 == 6) && BANDERA_HELPP == 0 && BANDERA_ALARPRE == 1 && BANDERA_ALARQUEM == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 1;
                        AlarV = 0;
                        DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;

                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x60f000, 0x0368, 0, 0);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

