francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
                        }
                    }


                    //        PRECALENTADOR CON AYUDA      
                    if ((ESTADO_0 == 0 || ESTADO_0 == 2 || ESTADO_0 == 4 || ESTADO_0 == 6) && BANDERA_HELPP == 1 && BANDERA_ALARPRE == 1 && BANDERA_ALARQUEM == 0 && BANDERA_ALARMOL == 0) {
                        AlarR = 1;
                        AlarV = 0;
                        DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;

                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x600000, 0x0368, 0, RES1);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }
                    }
                    //---------------------FIN ERRORES PRECALENTADOR --------------------------------------                        


                    // ESTADOS CON ALERTAS MOLINO          
                    if ((ESTADO_0 == 0 || ESTADO_0 == 2 || ESTADO_0 == 4 || ESTADO_0 == 6) && BANDERA_ALARMOL == 1 && BANDERA_HELPM == 0 && BANDERA_ALARPRE == 0 && BANDERA_ALARQUEM == 0) {
                        AlarR = 1;
                        AlarV = 0;
                        DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;

                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x60f000, 0x0369, 0, 0);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }
                    }

                    if ((ESTADO_0 == 0 || ESTADO_0 == 2 || ESTADO_0 == 4 || ESTADO_0 == 6) && BANDERA_ALARMOL == 1 && BANDERA_HELPM == 1 && BANDERA_ALARPRE == 0 && BANDERA_ALARQUEM == 0) {
                        AlarR = 1;
                        AlarV = 0;
                        DA = AlarR << 13 | EN_ESPERA << 10 | MODO_MANUAL << 11 | EN_CICLO << 12 | BombaM_march << 9 | Molino_march << 8 | Cesto_1 << 7 | Cesto_0 << 6 | Ctl_Llama << 5 | REpc << 4 | REbasc << 3 | AlarV << 2 | LlaQuemador << 1 | REhorno;

                        if (RX_CHEKA != CHEK_A) {
                            generar_A(0x600000, 0x0369, 0, RES1);
                        }
                        if (RX_CHEKA == CHEK_A) { //CONTROL DE LOS CHEK ENVIADO SK1 QUEMADOR
                            CHEK_A = -1;
                            ESTADO_1 = ESTADO_0;

                        }
                    }
                    //---------------------FIN ERRORES MOLINO ------------------


                } // FIN ESTADO TABLA ESTADO                 

                // FIN DE LA TABLA


                if (num == 0 && tabla_sk == 1 && !(tareas % 100)) { //20
                    ESTADO_1 = 10;
                    CHEK_A = -1;
                }
                //----------------- FIN MANEJO DE LA TABLA----------------------------- 


                //SOFTKEY SIN ALARMA                
                if ((SOFTK_N == 0) && (SOFTK_A == 5) && BANDERA_ALARQUEM == 0 && BANDERA_ALARPRE == 0) { //PULSO TECLA  5 ACTUALIZAR DENTRO DE MANUAL
                    SOFTK_A = 0;

                    if (num == 0 && BANDERA_quemador == 0 && BANDERA_molino == 0 && BANDERA_precalentador == 0) { // REVISAR CONDICION 
                        SOFTK_A = 0;
                        SK_C = 0;
                        CHEK_A = -1;
                        tareas = 0;
                        ESTADO_1 = 10;
                        SALIR_MANUAL = 0;
                        tabla_sk = 1;
                    }

                    // BANDERA DENTRO DEL QUEMADOR
                    if (num == 1 && tabla_sk == 0) {
                        BANDERA_ACTUALIZAQ = 1;
                    }

                    // BANDERA DENTRO DEL PRECALENTADOR   
                    if (num == 3 && tabla_sk == 0) {
                        BANDERA_ACTUALIZAP = 1;
                    }

                    // BANDERA DENTRO DEL MOLINO   
                    if (num == 2 && tabla_sk == 0) {
                        BANDERA_ACTUALIZAM = 1;
                    }

                } //    FIN SK5   ACTUALIZAR


                /*   QUEMADOR   */
                //PULSO TECLA  1 ENCENDER QUEMADOR DENTRO DE MANUAL                   
                if ((SOFTK_N == 0) && (SOFTK_A == 1) && (apagar_Q == 0)&& (BANDERA_ALARQUEM == 0) && Qmarch == 1) {
                    SOFTK_A = 0;
                    num = 1;

                    if (BANDERA_quemador == 1)
                        aviso_Qarr = 1;

                    BANDERA_quemador = 1;
                }// FIN DE SK1  QUEMADOR  


                //PULSO TECLA  1 APAGAR QUEMADOR DENTRO DE MANUAL          
                if ((SOFTK_N == 0) && (SOFTK_A == 1) && (apagar_Q == 1)&& (BANDERA_ALARQUEM == 0)) {
                    SOFTK_A = 0;
                    APQ = 0;
                    reset_tiempoQ();
                    apagar_Q = 0;
                    aviso_Qarr = 0;
                    BANDERA_quemador = 0;
                    Qarr = 1;
                    num = 0;

                } //FIN SK1  

                if (FINAL >= (tPIR1 + tPIR2 + tPIR3)) { // SE LLEGA AL TIEMPO MAXIMO TOTAL

                    SOFTK_A = 0;
                    APQ = 0;
                    reset_tiempoQ();
                    apagar_Q = 0;
                    aviso_Qarr = 0;
                    BANDERA_quemador = 0;
                    Qarr = 1;
                    num = 0;

                } // FIN DE CONTROL DE TIEMPO FINAL  


                // FIN SOFTKEY SIN ALARMA           


