francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
                //-------- HAY UNA ALARMA ENCENDIDA----------------- 
                if (SOFTK_A == 6 && SOFTK_N == 0 && (BANDERA_ALARQUEM == 1)) {
                    BANDERA_ALARMAQENC = 0;
                    SOFTK_A = 0;
                    BANDERA_ALARQUEM = 0;
                    BANDERA_HELPQ = 0;
                    RES1 = 0;
                }

                if (SOFTK_A == 4 && SOFTK_N == 0 && (BANDERA_ALARQUEM == 1)) {
                    SOFTK_A = 0;
                    BANDERA_HELPQ = 1;
                }


                if (APQ == 1 && TIR >= (STALARM + TCCORT)) {
                    // MODIFICAR ALARMA DE QUEMADOR ENCENDIDO CON TERMOCUPLA CORTADA
                    BANDERA_ALARMAQENC = 1;
                    RES1 = 4;
                    BANDERA_ALARQUEM = 1;
                    APQ = 0;
                    apagar_Q = 0;
                    aviso_Qarr = 0;
                    BANDERA_quemador = 0;
                    Qarr = 1;
                    num = 0;

                }

                //------------------------------------------------------------------------           
                if (APQ == 1) // TAREA ACTIVADA DEL QUEMADOR
                {
                    EN_ESPERA = 0;
                    MODO_MANUAL = 1;
                    EN_CICLO = 0;

                    tiempo_Q();
                    Apq(TMAN); //TAREA PERIODICA DEL QUEMADOR

                    //SE APAGO EL QUEMADOR
                    if (!Qmarch == 0) {
                        APQ = 0;
                        apagar_Q = 0;
                        aviso_Qarr = 0;
                        BANDERA_quemador = 0;
                        Qarr = 1;
                        num = 0;
                    }
                }
                //--------FIN QUEMADOR------------------------------------------------    



                /********************PRE CALENTADOR**************************/
                //PULSO TECLA  3 ENCENDER PRECALENTADOR DENTRO DE MANUAL                   
                if ((SOFTK_N == 0) && (SOFTK_A == 3) && (apagar_P == 0)&& (BANDERA_ALARPRE == 0) && PCmarch == 1) {
                    SOFTK_A = 0;
                    num = 3;

                    if (BANDERA_precalentador == 1)
                        aviso_Parr = 1;

                    BANDERA_precalentador = 1;
                }// FIN DE SK3  PRECALENTADOR  



                //PULSO TECLA  3 APAGAR PRECALENTADOR DENTRO DE MANUAL          
                if ((SOFTK_N == 0) && (SOFTK_A == 3) && (apagar_P == 1)&& (BANDERA_ALARPRE == 0)) {
                    SOFTK_A = 0;
                    APP = 0;
                    apagar_P = 0;
                    aviso_Parr = 0;
                    BANDERA_precalentador = 0;
                    PCarr = 1;
                    num = 0;

                } //FIN SK1  

                // FIN SOFTKEY SIN ALARMA           



                //-------- HAY UNA ALARMA ENCENDIDA----------------- 
                if (SOFTK_A == 6 && SOFTK_N == 0 && (BANDERA_ALARPRE == 1)) {
                    SOFTK_A = 0;
                    BANDERA_ALARPRE = 0;
                    BANDERA_HELPP = 0;
                    RES1 = 0;
                }

                if (SOFTK_A == 4 && SOFTK_N == 0 && (BANDERA_ALARPRE == 1)) {
                    SOFTK_A = 0;
                    BANDERA_HELPP = 1;
                }
                //------------------------------------------------------------------------           


                if (APP == 1) // TAREA ACTIVADA DEL PRECALENTADOR
                {
                    // LLego a la temperatura PARAMETRO CORTAR QUEMADOR

                    //SE APAGO EL QUEMADOR
                    if (!PCmarch == 0) {
                        APP = 0;
                        apagar_P = 0;
                        aviso_Parr = 0;
                        BANDERA_precalentador = 0;
                        PCarr = 1;
                        num = 0;
                    }
                }


                //PULSO TECLA 3 APAGAR PRECALENTADOR DENTRO DE MANUAL          
                if ((SOFTK_N == 0) && (SOFTK_A == 3) && (apagar_P == 1)&& (BANDERA_ALARPRE == 0)) {
                    SOFTK_A = 0;
                    APQ = 0;
                    apagar_P = 0;
                    aviso_Parr = 0;
                    BANDERA_precalentador = 0;
                    PCarr = 1;
                    num = 0;

                } //FIN SK1  
                //*********************FIN PRE CALENTADOR*************************************         




                /****************************MOLINO******************************************/
                //PULSO TECLA  2 ENCENDER MOLINO DENTRO DE MANUAL                   
                if ((SOFTK_N == 0) && (SOFTK_A == 2) && (apagar_M == 0) && (BANDERA_ALARMOL == 0) && (Lmarch == 0)) { //Lmarch == 1
                    SOFTK_A = 0;
                    num = 2;
                    
                    if (BANDERA_molino == 1){
                        aviso_Larr = 1;
                    }

                    BANDERA_molino = 1;
                }// FIN DE SK2  MOLINO 
                
//                 if ((SOFTK_N == 0) && (SOFTK_A == 2) && (BANDERA_ALARMOL == 0) && (BANDERA_molino == 1) && (Lmarch == 0)) { //Lmarch == 1
//                    SOFTK_A = 0;
//
//                    aviso_Larr = 1;
//
//                }// FIN DE SK1  MOLINO
                
                
                // Si no se cumple la condicion de funcionamiento y esta en marcha, detiene el molino
                if (Lmarch == 1 && !(PE2 == 1 && PE1 == 0)){
                    Larr = 1;
                    APM = 0;
                    apagar_M = 0;
                    aviso_Larr = 0;
                    BANDERA_molino = 0;
                    AlarS = 0;
                    num = 0;
                    BANDERA_lluviamarch = 0;
                }
                

                //PULSO TECLA 2 APAGAR MOLINO DENTRO DE MANUAL          
                if ((SOFTK_N == 0) && (SOFTK_A == 2) && (apagar_M == 1) && (BANDERA_ALARMOL == 0)) {
                    SOFTK_A = 0;
                    APM = 0;
                    apagar_M = 0;
                    aviso_Larr = 0;
                    BANDERA_molino = 0;
                    Larr = 1;
                    AlarS = 0;
                    num = 0;
                    BANDERA_lluviamarch = 0;
                }

                // FIN SOFTKEY SIN ALARMA           

                
