francoolmedo/MixOil/dspic33_software/inicio(v3).X/main.c
                //-------- HAY UNA ALARMA ENCENDIDA----------------- 
                if (SOFTK_A == 6 && SOFTK_N == 0 && (BANDERA_ALARMOL == 1)) {
                    SOFTK_A = 0;
                    BANDERA_ALARMOL = 0;
                    BANDERA_HELPM = 0;
                    RES1 = 0;
                }

                if (SOFTK_A == 4 && SOFTK_N == 0 && (BANDERA_ALARQUEM == 1)) {
                    SOFTK_A = 0;
                    BANDERA_HELPM = 1;
                }


                //------------------------------------------------------------------------           

                if (APM == 1) // TAREA ACTIVADA DEL MOLINO
                {
                    BANDERA_lluviamarch = 1;

                    //SE APAGO EL MOLINO
//                    if (Lmarch == 0) {
//                        APM = 0;
//                        BANDERA_lluviamarch = 0;
//                        apagar_M = 0;
//                        aviso_Larr = 0;
//                        BANDERA_molino = 0;
//                        Larr = 1;
//                        AlarS = 0;
//                        num = 0;
//                    }
                }


                //*************************FIN MOLINO***********************************  



                // if(!(tareas%50 && DMA0REQbits.FORCE==0)) {

                // TIP=TIRN; // PARA PROBAR APQ LUEGO BORRAR


                // CHEK_A=(TIR+PIR+ApSApSV+tCIC+TIB+TIP+TCF+TD+ND+00+DA+DB+ET+tETAP+FINAL)&(0x00FF);
                //datos    1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21      = caracteres 65

                // sprintf(aux_dma_tx,"A=%.3x%.3x%.3x%.3x%.3x%.3x%.3x%.3x%.3x%.2x%.3x%.3x%.4x%.4x%.3x%.3x%.3x%.3x%.3x%.2x%.2x\n",
                //        TIR,PIR,ApSApSV,tCIC,TIB,TIP,TCF,TD,ND,ET,tETAP,FINAL,DA,DB,RES1,RES2,RES3,RES4,RES5,00,CHEK_A);
                //         if(RX_CHEKA!=CHEK_A && DMA0REQbits.FORCE==0){     
                //           cargar_DMA_A(aux_dma_tx);
                //         enviar_DMA();
                //       tareas=0;


                //        }//TIEMPO DE ENVIO 4 SEG


                // }          
                /* NOOOO VAAAA  -------------------------------------------------------------------
                       // ACTUALIZA CON TECLA         
              if( (SOFTK_N==5) && (SOFTK_A==5)  && !(tareas%20) ){
              CHEK_A=(TIR+PIR+ApSApSV+tCIC+TIBasc+TIPC+TCF+TD+ND+0+DA+DB+ET+tETAP+FINAL)&(0x00FF);
                             //datos    1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17  18  19  20  21      = caracteres 65
               sprintf(aux_dma_tx,"A=%.3x%.3x%.3x%.3x%.3x%.3x%.3x%.3x%.3x%.2x%.3x%.3x%.4x%.4x%.3x%.3x%.3x%.3x%.3x%.2x%.2x\n",
                       TIR,PIR,ApSApSV,tCIC,TIBasc,TIPC,TCF,TD,ND,ET,tETAP,FINAL,DA,DB,RES1,RES2,RES3,RES4,RES5,0,CHEK_A);
               if(RX_CHEKA != CHEK_A){
                            cargar_DMA_A(aux_dma_tx);
                            enviar_DMA();
                            tareas=0;
                            SOFTK_N=0;
                                      }
                 
                                                                         }
                 */

                //finaliza PUNTO 5     

                /* A PARTIR DE AQUI EL PROCESO ENTRA EN MODO PRODUCCION SIN POSIBILIDAD DE ENTRAR EN PARAMETROS */


                /*
                   if(Punto==13){  // ->SI ESTA EN CICLO 
                      tareas++; // variable tarea (cuenta ticks) t=10ms
                         if(!(tareas%2)) {
                    
                            if(SEL==1){
                                      for(i=0;i<=TAM_CONVERSOR-1;i++)     
                                      V[i]=convierteAD(i);
                                      operando_b=(double)V[1]*b;
                                      operando_a=VF_anterior*a;
                                      SEL^=1;    
                  
                                      }
                                  else
                                {
                   
                                for(i=0;i<=TAM_CONVERSOR-1;i++)     
                                V[i+4]=convierteAD(i);
                                operando_b=(double)V[1]*b;
                                operando_a=VF_anterior*a;
                                  SEL^=1;
                   
                                  }     
                                                   }   
                       
       
        
                       if(!(tareas%4)){
            
                                VF_actual=operando_a+operando_b;  
                                VF_anterior=VF_actual;
                                VF_actual=VF_actual/2;
                                      }
                       
                    
   
                       if(!(tareas%98)){
     
                            //   sprintf(aux_dma_tx,"h1:%.2f,%d\n",VF_actual,V[1]);
               //control  1   2     3      4    5     6    7   8  9      10      11 12 
                   CHEK_A=(TIR+PIR+ApSApSV+tCIC+TIBasc+TIPC+TCF+TD+ND+00+DA+DB+ET+tETAP+FINAL)&(0x00FF);
                                 //datos    1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16 17   = caracteres 48
                   sprintf(aux_dma_tx,"A=%.3x%.3x%.3x%.3x%.3x%.3x%.3x%.3x%.3x%.2x%.3x%.3x%.2x%.4x%.4x%.2x\n",
                           TIR,PIR,ApSApSV,tCIC,TIBasc,TIPC,TCF,TD,ND,ET,tETAP,FINAL,00,DA,DB,CHEK_A);
                             }
                           //sprintf(aux_dma_tx,"A=%d  \n",SOFTK_ACTUAL );
        
                      if(!(tareas%99)){    
                      cargar_DMA_A(aux_dma_tx);
                        
                                      } 
       
                       if(!(tareas%100)){
                                enviar_DMA();
                                tareas=0;
                       }
                              
                 */

            } // FINAL DE PUNTO 5


            break;

        default: break;

    }

    IFS0bits.T2IF = 0; // Clear Timer1 Interrupt Flag

    return;
}



